Workspace/test_cases/03-hisa-shocktube/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|                                                                             |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;
libs ("libsampling.so");
type sets;
setFormat       raw;

sets
(
    data
    {
        type    cellCentre;
        axis    x;
        start   ( -5 0 0 );
        end     ( 5 0 0 );
        nPoints 100;
    }
);

fields          (T mag(U) p);


// ************************************************************************* //
