Workspace/test_cases/03-hisa-shocktube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue p 101325
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue T 273.15
);

regions
(
    boxToCell
    {
        box (0 0 0) (0.5 0.1 0.1);

        fieldValues
        (
            volScalarFieldValue p 303975
        );
    }
);


// ************************************************************************* //
